<script setup lang="ts"></script>
<template>
  <section class="rules page">
    <div class="container">
      <h1 class="title rules__title">Правила <span>AML</span></h1>
      <div class="article">
        <p>На Платформе действуют правила AML:</p>
        <ol>
          <li>
            Клиент не вправе использовать функционал Платформы для совершения
            незаконных транзакций с нарушением AML и CTF политики Платформы.
            Клиент осознает, что он будет привлечен к ответственности за
            использование сомнительных средств. Ответственность наступает по
            нормам государства, в юрисдикции которого имело место нарушение.
          </li>
          <li>
            Мы вправе заблокировать транзакцию и запросить у вас верификацию при
            блокировке данных активов на Catbit. До момента верификации мы не
            вправе распоряжаться этими средствами.
          </li>
          <li>
            Если связь обнаружена и/или процент риска составляет более 50%,
            обмен останавливается, инициализируется процедура возврата на
            кошелек, с которого были получены средства.
          </li>
          <li>
            Для возврата средств необходимо предоставить скриншот (видео)
            перевода с кошелька, а также хэш транзакции и адрес криптовалюты с
            почты, указанной в заявке на обмен.
          </li>
        </ol>
      </div>
    </div>
  </section>
</template>
