<template>
  <section class="program page">
    <div class="container">
      <div class="program-block partners-block">
        <picture>
          <source srcset="/img/program-bg2.webp" type="image/webp" />
          <source srcset="/img/program-bg2.png" type="image/png" />
          <img class="program__bg2" src="/img/program-bg2.png" />
        </picture>
        <div class="program-row">
          <div class="program-l">
            <h1 class="program__title title">
              Присоединяйся <br />
              к программе <span>лояльности</span>
            </h1>
            <div class="program-info">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="16"
                height="16"
                viewBox="0 0 16 16"
                fill="none"
              >
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M5.62195 1.01357C3.83372 1.01357 2.38405 2.45059 2.38405 4.22323C2.38405 5.4731 3.10466 6.55705 4.15885 7.08743C4.34234 7.17974 4.45211 7.3721 4.43741 7.57554C4.42271 7.77899 4.28641 7.95388 4.09152 8.01933C2.52381 8.54583 1.3416 9.85589 1.03434 11.4547C1.00192 11.6233 1.03969 11.7425 1.09472 11.8183C1.14942 11.8937 1.24982 11.9657 1.41949 11.9872C2.11184 12.0751 3.37074 12.1629 5.62325 12.1629C6.19155 12.1629 6.69691 12.1573 7.14614 12.1475C7.42843 12.1413 7.66231 12.3632 7.66852 12.643C7.67474 12.9228 7.45094 13.1547 7.16866 13.1608C6.71114 13.1708 6.19823 13.1765 5.62325 13.1765C3.35032 13.1765 2.04303 13.0882 1.28958 12.9926C0.867985 12.9391 0.501403 12.7363 0.264823 12.4104C0.0285684 12.085 -0.0492333 11.6767 0.029906 11.265C0.346804 9.61609 1.4143 8.22998 2.86938 7.44671C1.94752 6.67241 1.36155 5.51591 1.36155 4.22323C1.36155 1.8908 3.26901 0 5.62195 0C7.9749 0 9.88235 1.8908 9.88235 4.22323C9.88235 5.51543 9.29682 6.67152 8.37556 7.44581C8.78484 7.66594 9.16324 7.93363 9.50286 8.24127C9.7113 8.43008 9.72586 8.75064 9.53539 8.95725C9.34491 9.16387 9.02154 9.1783 8.8131 8.9895C8.3412 8.56202 7.77748 8.22817 7.15355 8.01884C6.95865 7.95345 6.82229 7.7786 6.80753 7.57516C6.79276 7.37172 6.90248 7.17933 7.08593 7.08696C8.13966 6.55641 8.85986 5.47274 8.85986 4.22323C8.85986 2.45059 7.41019 1.01357 5.62195 1.01357Z"
                  fill="url(#paint0_linear_2212_1886)"
                />
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M10.1176 10.7807C9.58605 10.7807 9.15508 11.1159 9.15508 11.5294C9.15508 11.9429 9.58605 12.2781 10.1176 12.2781C10.6492 12.2781 11.0802 11.9429 11.0802 11.5294C11.0802 11.1159 10.6492 10.7807 10.1176 10.7807ZM8 11.5294C8 10.6198 8.94812 9.88235 10.1176 9.88235C11.2872 9.88235 12.2353 10.6198 12.2353 11.5294C12.2353 12.439 11.2872 13.1765 10.1176 13.1765C8.94812 13.1765 8 12.439 8 11.5294Z"
                  fill="url(#paint1_linear_2212_1886)"
                />
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M14.1176 8.55615C13.6451 8.55615 13.262 8.93923 13.262 9.41177C13.262 9.88429 13.6451 10.2674 14.1176 10.2674C14.5902 10.2674 14.9733 9.88429 14.9733 9.41177C14.9733 8.93923 14.5902 8.55615 14.1176 8.55615ZM12.2353 9.41177C12.2353 8.37218 13.0781 7.52941 14.1176 7.52941C15.1572 7.52941 16 8.37218 16 9.41177C16 10.4513 15.1572 11.2941 14.1176 11.2941C13.0781 11.2941 12.2353 10.4513 12.2353 9.41177Z"
                  fill="url(#paint2_linear_2212_1886)"
                />
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M12.2353 13.8824C12.2353 12.7128 13.0781 11.7647 14.1176 11.7647C15.1572 11.7647 16 12.7128 16 13.8824C16 15.0519 15.1572 16 14.1176 16C13.0781 16 12.2353 15.0519 12.2353 13.8824ZM14.1176 12.9198C13.6451 12.9198 13.262 13.3508 13.262 13.8824C13.262 14.4139 13.6451 14.8449 14.1176 14.8449C14.5902 14.8449 14.9733 14.4139 14.9733 13.8824C14.9733 13.3508 14.5902 12.9198 14.1176 12.9198Z"
                  fill="url(#paint3_linear_2212_1886)"
                />
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M13.117 9.6819C13.2384 9.94156 13.1681 10.2748 12.9599 10.4263L11.4798 11.5034C11.2716 11.6548 11.0044 11.5671 10.883 11.3075C10.7616 11.0478 10.8319 10.7145 11.0401 10.5631L12.5202 9.48599C12.7284 9.33453 12.9956 9.42224 13.117 9.6819ZM10.883 12.2219C11.0044 11.9623 11.2716 11.8746 11.4798 12.026L12.9599 13.1031C13.1681 13.2546 13.2384 13.5879 13.117 13.8475C12.9956 14.1072 12.7284 14.1949 12.5202 14.0434L11.0401 12.9663C10.8319 12.8149 10.7616 12.4816 10.883 12.2219Z"
                  fill="url(#paint4_linear_2212_1886)"
                />
                <defs>
                  <linearGradient
                    id="paint0_linear_2212_1886"
                    x1="1.8034"
                    y1="8.41611"
                    x2="14.1562"
                    y2="8.41585"
                    gradientUnits="userSpaceOnUse"
                  >
                    <stop stop-color="#4E57F5" />
                    <stop offset="1" stop-color="#5286F5" />
                  </linearGradient>
                  <linearGradient
                    id="paint1_linear_2212_1886"
                    x1="1.8034"
                    y1="8.41611"
                    x2="14.1562"
                    y2="8.41585"
                    gradientUnits="userSpaceOnUse"
                  >
                    <stop stop-color="#4E57F5" />
                    <stop offset="1" stop-color="#5286F5" />
                  </linearGradient>
                  <linearGradient
                    id="paint2_linear_2212_1886"
                    x1="1.8034"
                    y1="8.41611"
                    x2="14.1562"
                    y2="8.41585"
                    gradientUnits="userSpaceOnUse"
                  >
                    <stop stop-color="#4E57F5" />
                    <stop offset="1" stop-color="#5286F5" />
                  </linearGradient>
                  <linearGradient
                    id="paint3_linear_2212_1886"
                    x1="1.8034"
                    y1="8.41611"
                    x2="14.1562"
                    y2="8.41585"
                    gradientUnits="userSpaceOnUse"
                  >
                    <stop stop-color="#4E57F5" />
                    <stop offset="1" stop-color="#5286F5" />
                  </linearGradient>
                  <linearGradient
                    id="paint4_linear_2212_1886"
                    x1="1.8034"
                    y1="8.41611"
                    x2="14.1562"
                    y2="8.41585"
                    gradientUnits="userSpaceOnUse"
                  >
                    <stop stop-color="#4E57F5" />
                    <stop offset="1" stop-color="#5286F5" />
                  </linearGradient>
                </defs>
              </svg>
              <span>Получай 0,3% за привлечение новых клиентов</span>
            </div>
            <div class="program__text">
              Наш сервис предоставляет отличную возможность заработать. Ты
              можешь стать нашим партнером и зарабатывать вместе с нами, получая
              0.3% от общей суммы за каждый обмен.
            </div>
          </div>
          <div class="program-r">
            <div class="program-r__title">Для этого нужно:</div>
            <div class="program-r_block">
              <div class="program-box is-active">
                <div class="program-box__title">1</div>
                <div class="program-box__text">
                  Зарегистрироваться на нашем сайте и получить реферальную
                  ссылку
                </div>
              </div>
              <div class="program-box">
                <div class="program-box__title">2</div>
                <div class="program-box__text">
                  Разместить нашу ссылку в вашем блоге, на вашей странице в
                  соцсети, на вашем youtube канале. <br />А так же вы можете
                  приглашать ваших друзей
                </div>
              </div>
              <div class="program-box">
                <div class="program-box__title">3</div>
                <div class="program-box__text">
                  Получать начисленные по программе средства любым удобным для
                  вас способом!
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </section>
</template>
