<script setup lang="ts"></script>
<template>
  <section class="rules page">
    <div class="container">
      <h1 class="title rules__title">Правила <span>обмена</span></h1>
      <div class="article">
        <p>Пользуясь данным сайтом Вы соглашаетесь на следующие правила:</p>
        <ol>
          <li>
            Обмен осуществляется после поступления денег на счет Платформы.
            Обмен производится по курсу, действовавшему в момент получения
            средств на реквизиты Платформы
          </li>
          <li>
            Обмен считается выполненным после перевода средств на реквизиты,
            указанные Клиентом.
          </li>
          <li>
            Клиент не вправе требовать отмены начатой операции или возврата
            средств, используемых в обмене.
          </li>
          <li>
            При отправлении Клиентом средств, количество которых не совпадает с
            заявкой, администрация Платформы вправе приостановить обмен.
          </li>
          <li>
            Если Клиент указал несуществующие реквизиты, то Платформа в праве не
            осуществлять обмен.
          </li>
          <li>
            При осуществлении обмена с участием Биткоинов, нужно учитывать
            длительность перевода, который занимает от четверти часа до
            нескольких дней. У сотрудников Платформы нет возможности сократить
            этот срок. Курс определяется в соответствии с пунктом 1.
          </li>
          <li>
            На Платформе действуют правила AML. Клиент не вправе использовать
            функционал Платформы для совершения незаконных транзакций с
            нарушением AML и CTF политики Платформы. Клиент осознает, что он
            будет привлечен к ответственности за использование сомнительных
            средств. Ответственность наступает по нормам государства, в
            юрисдикции которого имело место нарушение.
          </li>
          <li>
            Платформа не отвечает за обмен, выполненный третьими лицами по
            согласию Клиента.
          </li>
          <li>
            Клиент не вправе отменить заявку. Все средства придут на указанные
            клиентом реквизиты при составлении заявки.
          </li>
          <li>
            Если Клиент совершает операцию по обмену, то он выражает полное
            принятие всех условий Соглашения.
          </li>
        </ol>
      </div>
    </div>
  </section>
</template>
